---
kind: other
id: Properties.T:Autodesk.Revit.DB.InstanceNode
source: html/a0b67c40-4738-1217-9760-f2a75bd9499e.htm
---
# InstanceNode Properties

Specifies whether the .NET object represents a valid Revit entity.